export default [
  '梦想不会自动成真，奋斗是其桥梁；目标不会自动抵达，奔跑才有远方!',
  '成长是一场和自己的比赛，不要担心别人会做得比你好，只要你每天都比前一天做得好!',
  '最慢的步伐不是跬步，而是徘徊；最快的脚步不是冲刺，而是坚持!',
  '平日里的千锤百炼，才能托举出光彩时刻；逆境中的亮剑、失败后的奋起，才能让梦想成真。哪有什么一战成名，其实都是百炼成钢。“天才”都是汗水浇灌出来的，天赋或许可以决定起点，但唯有坚持和努力才能达到终点。',
  '历尽天华成此景，人间万事出艰辛。志不求易者成，事不避难者进!',
  '每一个不向命运低头、努力生活的人，都值得被尊重。',
  '青年的肩上，从不只有清风明月，更有责任担当。岁月因青春慨然以赴而更加美好，世间因少年挺身向前而更加瑰丽。请相信，不会有人永远年轻，但永远有人年轻。',
  '人生路上，总有人走得比你快，但不必介意，也不必着急。一味羡慕别人的成绩，只会给自己平添压力、徒增烦恼。不盲从别人的脚步，坚定目标，才能找到自己的节奏，进而逢山开路、遇水搭桥。',
  '没有理所当然的成功，也没有毫无道理的平庸。值得拥有的东西，永远都来之不易。所以在徘徊迷茫时，不要质疑你的付出，这些累积都会变成一种沉淀，默默为你铺路!',
];
